


/*code an IDCAMS job using REPRO FROM KEY  TO KEY


//WPR109A JOB WIPRO,SUSI,CLASS=A,NOTIFY=&SYSUID
//STEP1 EXEC PGM=IDCAMS
//DD1 DD DSN=WPR109.MAR11.KSDS1,DISP=OLD
//DD2 DD DSN=WPR109.MAR11.KSDS2,DISP=OLD
//SYSIN DD *
   REPRO INFILE(DD1) OUTFILE(DD2) FROMKEY(101) TOKEY(104)
/*
//SYSPRINT DD SYSOUT=*