


/*Copy the records from KSDS to ESDS using REPRO.-yes


//WPR109A JOB WIPRO,SUSI,CLASS=A,NOTIFY=&SYSUID
//STEP1 EXEC PGM=IDCAMS
//DD1 DD DSN=WPR109.MAR11.KSDS,DISP=OLD
//DD2 DD DSN=WPR109.MAR11.ESDS,DISP=OLD
//SYSIN DD *
  REPRO INFILE(DD1) OUTFILE(DD2)
/*
//SYSPRINT DD SYSOUT=*