


/*Copy the records from ESDS to RRDS using REPRO.-Yes(REPLACE)


//WPR109A JOB WIPRO,SUSI,CLASS=A,NOTIFY=&SYSUID
//STEP1 EXEC PGM=IDCAMS
//DD1 DD DSN=WPR109.MAR11.ESDS,DISP=OLD
//DD2 DD DSN=WPR109.MAR11.RRDS,DISP=OLD
//SYSIN DD *
  REPRO INFILE(DD1) OUTFILE(DD2)
  REPLACE
/*
//SYSPRINT DD SYSOUT=*