

/*Copy the records from RRDS to KSDS using REPRO.


//WPR109A JOB WIPRO,SUSI,CLASS=A,NOTIFY=&SYSUID
//STEP1 EXEC PGM=IDCAMS
//DD1 DD DSN=WPR109.MAR11.RRDS,DISP=OLD
//DD2 DD DSN=WPR109.MAR11.KSDS,DISP=OLD
//SYSIN DD *
  REPRO INFILE(DD1) OUTFILE(DD2)
/*
//SYSPRINT DD SYSOUT=*