


/*Copy the records from one file to another file using 
  skip and count verbs.


//WPR109A JOB WIPRO,SUSI,CLASS=A,NOTIFY=&SYSUID
//STEP1 EXEC PGM=IDCAMS
//DD1 DD DSN=WPR109.MAR11.KSDS1,DISP=OLD
//DD2 DD DSN=WPR109.MAR11.KSDS2,DISP=OLD
//SYSIN DD *
  REPRO INFILE(DD1) OUTFILE(DD2) SKIP(3) COUNT(4)
/*
//SYSPRINT DD SYSOUT=*
