


/*code an IDCAMS job using REPRO FROM ADDRESS  TO ADDRESS


//WPR109A JOB WIPRO,SUSI,CLASS=A,NOTIFY=&SYSUID
//STEP1 EXEC PGM=IDCAMS
//DD1 DD DSN=WPR109.MAR11.ESDS1,DISP=OLD
//DD2 DD DSN=WPR109.MAR11.ESDS2,DISP=OLD
//SYSIN DD *
   REPRO INFILE(DD1) OUTFILE(DD2) FROMADDRESS(0) TOADDRESS(79)
/*
//SYSPRINT DD SYSOUT=*