


/*code a program to print the records from the RRDS File


//WPR109A JOB WIPRO,SUSI,CLASS=A,NOTIFY=&SYSUID
//STEP1 EXEC PGM=IDCAMS
//DD1 DD DSN=WPR109.MAR11.RRDS,DISP=OLD
//SYSIN DD *
   PRINT INFILE(DD1) CHAR
/*
//SYSPRINT DD SYSOUT=*

     