


/*Identify the use of theREPLACE option using IDCAMS.


By using this REPLACE option we can replace the records 
in target file with the records in source file

//WPR109A JOB INTERN,SUSI,CLASS=A,NOTIFY=&SYSUID
//STEP1 EXEC PGM=IDCAMS
//DD1 DD DSN=WPR109.MAR11.PS,DISP=OLD
//DD2 DD DSN=WPR109.MAR11.RRDS,DISP=OLD
//SYSIN DD *
  REPRO INFILE(DD1) OUTFILE(DD2)	-
  REPLACE
/*
//SYSPRINT DD SYSOUT=*