

/*write a program to work with decimal nos. (ACCEPT, VALUE AND MOVE) 
(Hint:Declare a variable for decimal value and accept the value from SYSIN,
 MOVE and VALUE clause and display the same). 



IDENTIFICATION DIVISION.
PROGRAM-ID. PRG7.
ENVIRONMENT  DIVISION.
DATA DIVISION.
WORKING-STORAGE SECTION.
77 TEMP PIC 9(2) V9 (2).
PROCEDURE DIVISION.
       ACCEPT TEMP.
       DISPLAY TEMP.
       STOP RUN.
