

/*write a program for work with signed nos. (ACCEPPT, VALUE and MOVE statement).
 Also check the difference with sign leading, sign leading seperate.


IDENTIFICATION DIVISION.
PROGRAM-ID. PRG8.
ENVIRONMENT DIVISION.
DATA DIVISION.
WORKING-STORAGE SECTION.
77 TEMP PIC S9(4).
PROCEDURE DIVISION.
     ACCEPT TEMP.
     DISPLAY TEMP.
     STOP RUN.

