

/*write a program to implement the subroutine with call by content. For eg: addition two numbers.

Main Program
IDENTIFICATION DIVISION.
PROGRAM-ID. MAIN1.
ENVIRONMENT DIVISION.
INPUT-OUTPUT SECTION.
FILE-CONTROL.
DATA DIVISION.
FILE SECTION.
WORKING-STORAGE SECTION.
77 NUM1 PIC 9(3) VALUE 100.
77 NUM2 PIC 9(3) VALUE 200.
77 TOTAL PIC 9(4).
PROCEDURE DIVISION.
	CALL ‘SUB2’ USING BY CONTENT NUM1, BY CONTENT NUM2,
	BY CONTENT TOTAL.
	DISPLAY “HELLO I AM THE MAIN PROGRAM :)”
	DISPLAY “NUM 1: ” NUM1.
	DISPLAY “NUM 2: ” NUM2.
	DISPLAY “TOTAL: ” TOTAL.
	STOP RUN.