

//*write a CATALOG PROCEDURE to swap the content of 2 datasets & using this proc write a JCL to swap the content.

CATALOG PROCEDURE:

//STEP1 EXEC PGM=IEBGENER
//SYSUT1 DD DSN=&SRC,DISP=OLD
//SYSUT2 DD DSN=&TEMP,DISP=OLD
//SYSIN DD DUMMY
//SYSPRINT DD SYSOUT=*
//STEP2 EXEC PGM=IEBGENER
//SYSUT1 DD DSN=&TAR,DISP=OLD
//SYSUT2 DD DSN=&SRC,DISP=OLD
//SYSIN DD DUMMY
//SYSPRINT DD SYSOUT=*
//STEP3 EXEC PGM=IEBGENER
//SYSUT1 DD DSN=&TEMP,DISP=OLD
//SYSUT2 DD DSN=&TAR,DISP=OLD
//SYSIN DD DUMMY
//SYSPRINT DD SYSOUT=*

JCL:

//WPR109A JOB INTERN,SUSI,CLASS=A,NOTIFY=&SYSUID
//MYLIB JCLLIB ORDER=WPR109.MAR10.PROCPDS
//STEP1 EXEC PROC=PRO1,SRC=WPR109.MAR10.SRC,TAR=WPR109.MAR.10.TAR,TEMP=WPR109.MAR10.TEMP
