

/*write a COBOL program to accept the string values for first-name, middle-name 
  and last-name conctenate them and store in a data item name. Use string verb.


IDENTIFICATION DIVISION.
PROGRAM-ID. PRG37.
ENVIRONMENT DIVISION.
INPUT-OUTPUT SECTION.
FILE-CONTROL.
DATA DIVISION.
FILE SECTION.
WORKING-STORAGE SECTION.
01 NAME.
	10 FIRST-NAME PIC X(10).
	10 MIDDLE-NAME PIC X(10).
	10 LAST-NAME PIC X(10).
01 FULL-NAME PIC X(33).
PROCEDURE DIVISION.
MAIN-PARA.
	PERFORM ACCEPT-PARA.
	PERFORM CONCAT-PARA.
	PERFORM DISPLAY-PARA.
	STOP RUN.
ACCEPT-PARA.
	ACCEPT FIRST-NAME.
	ACCEPT MIDDLE-NAME.
	ACCEPT LAST-NAME.
CONCAT-PARA.
	STRING
	FIRST-NAME DELIMITED BY SPACE
		‘ ‘ DELIMITED BY SIZE
	MIDDLE-NAME DELIMITED BY SPACE
		‘ ‘ DELIMITED BY SIZE
	LAST-NAME DELIMITED BY SPACE
		‘ ‘ DELIMITED BY SIZE
	INTO FULL-NAME.
DISPLAY-PARA.
	DISPLAY “FIRST NAME: ” FIRST-NAME.
	DISPLAY “MIDDLE NAME: ” MIDDLE-NAME.
	DISPLAY “LAST NAME: ” LAST-NAME.
	DISPLAY “============”
	DISPLAY “FULL NAME: ” FULL-NAME.

