

/*write a COBOL program to separate the character in variable name and store
  them in first-name, middle-name and last-name.Use UNSTRING verb.


IDENTIFICATION DIVISION.
PROGRAM-ID. PRG37.
ENVIRONMENT DIVISION.
INPUT-OUTPUT SECTION.
FILE-CONTROL.
DATA DIVISION.
FILE SECTION.
WORKING-STORAGE SECTION.
01 NAME.
	10 FIRST-NAME PIC X(10).
	10 MIDDLE-NAME PIC X(10).
	10 LAST-NAME PIC X(10).
01 FULL-NAME PIC X(33).
PROCEDURE DIVISION.
MAIN-PARA.
	PERFORM ACCEPT-PARA.
	PERFORM CONCAT-PARA.
	PERFORM DISPLAY-PARA.
	STOP RUN.
ACCEPT-PARA.
	ACCEPT FULL-NAME.
CONCAT-PARA.
	UNSTRING
		FULL-NAME DELIMITED BY SPACE
		INTO FIRST-NAME MIDDLE-NAME LAST-NAME
	END-UNSTRING.
DISPLAY-PARA.
	DISPLAY “FULL NAME: ” FULL-NAME.
	DISPLAY “============”
	DISPLAY “FIRST NAME: ” FIRST-NAME.
	DISPLAY “MIDDLE NAME: ” MIDDLE-NAME.
	DISPLAY “LAST NAME: ” LAST-NAME.

