

/*write a program to count the no. occurence of a character in given string.


IDENTIFICATION DIVISION.
PROGRAM-ID. PRG37.
ENVIRONMENT DIVISION.
INPUT-OUTPUT SECTION.
FILE-CONTROL.
DATA DIVISION.
FILE SECTION.
WORKING-STORAGE SECTION.
01 USER-INPUT PIC X(10).
01 CHAR-COUNT PIC 9(2).
PROCEDURE DIVISION.
MAIN-PARA.
	PERFORM ACCEPT-PARA.
	PERFORM CHANGE-PARA.
	PERFORM DISPLAY-PARA.
	STOP RUN.
ACCEPT-PARA.
	ACCEPT USER-INPUT.
CHANGE-PARA.
	INSPECT USER-INPUT TALLYING CHAR-COUNT FOR ALL ‘A’.
DISPLAY-PARA.
	DISPLAY “USER INPUT IS: ” USER-INPUT.
	DISPLAY “==========================”.
	DISPLAY “THE COUNT OF CHARACTER IS: ” CHAR-COUNT.
	DISPLAY “==========================”.