

/*write a program to replace a specified character with given character in input string.


IDENTIFICATION DIVISION.
PROGRAM-ID. PRG37.
ENVIRONMENT DIVISION.
INPUT-OUTPUT SECTION.
FILE-CONTROL.
DATA DIVISION.
FILE SECTION.
WORKING-STORAGE SECTION.
01 USER-INPUT PIC X(10).
PROCEDURE DIVISION.
MAIN-PARA.
	PERFORM ACCEPT-PARA.
	PERFORM DISPLAY-PARA.
	PERFORM CHANGE-PARA.
	PERFORM DISPLAY-PARA.
	STOP RUN.
ACCEPT-PARA.
	ACCEPT USER-INPUT.
CHANGE-PARA.
	INSPECT USER-INPUT REPLACING ALL ‘A’ BY ‘W’.
	DISPLAY-PARA.
	DISPLAY “USER INPUT IS: ” USER-INPUT.
	DISPLAY “==========================”.

