

/*write a program to remove all leading zeros in given string.


IDENTIFICATION DIVISION.
PROGRAM-ID. PRG37.
ENVIRONMENT DIVISION.
INPUT-OUTPUT SECTION.
FILE-CONTROL.
DATA DIVISION.
FILE SECTION.
WORKING-STORAGE SECTION.
01 USER-INPUT PIC X(10).
PROCEDURE DIVISION.
MAIN-PARA.
	PERFORM ACCEPT-PARA.
	PERFORM CHANGE-PARA.
	PERFORM DISPLAY-PARA.
	STOP RUN.
ACCEPT-PARA.
	ACCEPT USER-INPUT.
CHANGE-PARA.
	INSPECT USER-INPUT REPLACING LEADING ZEROES BY ‘ ‘.
DISPLAY-PARA.
	DISPLAY USER-INPUT.
	DISPLAY “MODIFIED USER INPUT IS: ” USER-INPUT.