

/*write a program to get a string 'HELLO' and reverse it.


IDENTIFICATION DIVISION.
PROGRAM-ID. PRG37.
ENVIRONMENT DIVISION.
INPUT-OUTPUT SECTION.
FILE-CONTROL.
DATA DIVISION.
FILE SECTION.
WORKING-STORAGE SECTION.
01 USER-INPUT PIC X(20).
01 STR-LEN PIC 9(2).
01 NEW-STR PIC X(20).
01 I PIC 9(2).
01 J PIC 9(2) VALUE 1.
PROCEDURE DIVISION.
MAIN-PARA.
	PERFORM ACCEPT-PARA.
	PERFORM CHANGE-PARA.
	PERFORM DISPLAY-PARA.
	STOP RUN.
ACCEPT-PARA.
	ACCEPT USER-INPUT.
CHANGE-PARA.
	INSPECT USER-INPUT TALLYING STR-LEN FOR CHARACTERS
	BEFORE ‘ ‘.
		PERFORM VARYING I FROM STR-LEN BY -1 UNTIL I = 0
		MOVE USER-INPUT(I:1) TO NEW-STR(J:1)
		COMPUTE J = J + 1
	END-PERFORM.
DISPLAY-PARA.
	DISPLAY “THE STR-LEN IS: ” STR-LEN.
	DISPLAY NEW-STR.
