


/*Code an IDCAMS program with EXPORT command of any VSAM file


//WPR109A JOB INTERN,SUSI,CLASS=A,NOTIFY=&SYSUID
//STEP1 EXEC PGM=IDCAMS
//DD1 DD DSN=WPR109.MAR11.PS,DISP=OLD
//DD2 DD DSN=WPR109.MAR11.KSDS,DISP=OLD
//SYSIN DD *
 EXPORT INFILE(DD2) OUTFILE(DD1)
/*
//SYSPRINT DD SYSOUT=*