

/*write a program to display the given character is vowel, consonant 
  or digit using Condition name (88 level)

       IDENTIFICATION DIVISION.                                     
       PROGRAM-ID. PRG25.                                           
       ENVIRONMENT DIVISION.                                        
       DATA DIVISION.                                               
       WORKING-STORAGE SECTION.                                     
       01 INP-CHAR         PIC X(1).                                
           88 VOWEL         VALUE "A", "E", "I", "O", "U".          
           88 CONSONANT     VALUE "B", "C", "D", "F", "G", "H"      
                                  "J" THRU "N", "P" THRU "T"        
                                  "V" THRU "Z".                     
           88 DIGIT         VALUE "0" THRU "9".                     
        PROCEDURE DIVISION.                                    
        MAIN-PARA.                                             
            PERFORM ACCEPT-PARA.                               
            PERFORM COMP-PARA.                                 
            STOP RUN.                                          
        ACCEPT-PARA.                                           
            ACCEPT INP-CHAR.                                   
        COMP-PARA.                                             
            IF VOWEL                                           
               DISPLAY "THE GIVEN CHARACTER IS A VOWEL!"       
            ELSE IF CONSONANT                                  
               DISPLAY "THE GIVEN CHARACTER IS A CONSONENT!"   
            ELSE IF DIGIT                                      
               DISPLAY "THE GIVEN CHARACTER IS A DIGIT!"       
            ELSE                                               
              DISPLAY "THE GIVEN CHARACTER IS AN INVALID CHARACTER!"   
           END-IF.         
