

//*copy the contents of current generation to new generation

//WPR109A JOB INTERN,SUSI,CLASS=A,NOTIFY=&SYSUID
//STEP1 EXEC PGM=IDCAMS
//SYSUT1 DD DSN=WPR109.INTERN.PS1.GDG(0),DISP=OLD,
//SYSUT2 DD DSN=WPR109.INTERN.PS1.GDG(+1),
//          DISP=(NEW,CATLG,DELETE),
//	    SPACE=(TRK,(1,3,0)),
//	    DCB=(LRECL=80,RECFM=FB,BLKSIZE=800)
//SYSIN DD *
//SYSPRINT DD SYSOUT=*
