
//*Copy the content from PS to PS dataset 


//WPR109SA JOB INTERN, SUSI, CLASS=A,NOTIFY=&SYSUID
//STEP1 EXEC PGM=IEBGENER
//SYSUT1 DD DSN=WPR109.MAR10.SRCPS,DISP=OLD
//SYSUT2 DD DSN=WPR109.MAR10.TARPS,DISP=OLD
//SYSIN DD DUMMY
//SYSPRINT DD SYSOUT=*