

//*swap the content of 2 PS using IEBGENER dataset(Use the Temporary dataset)


//WPR109A JOB INTERN,SUSI,CLASS=A,NOTIFY=&SYSUID
//STEP1 EXEC PGM=IEBGENER
//SYSUT1 DD DSN=WPR109.INTERN.SRC,DISP=OLD
//SYSUT2 DD DSN=WPR109.INTERN.TEMP,DISP=OLD
//SYSIN DD DUMMY
//SYSPRINT DD SYSOUT=*
//STEP2 EXEC PGM=IEBGENER
//SYSUT1 DD DSN=WPR109.INTERN.TAR,DISP=OLD
//SYSUT2 DD DSN=WPR109.INTERN.SRC,DISP=OLD
//SYSIN DD DUMMY
//SYSPRINT DD SYSOUT=*
//STEP3 EXEC PGM=IEBGENER
//SYSUT1 DD DSN=WPR109.INTERN.TEMP,DISP=OLD
//SYSUT2 DD DSN=WPR109.INTERN.TAR,DISP=OLD
//SYSIN DD DUMMY
//SYSPRINT DD SYSOUT=*
	 