
//*Copy the content from existing PS to existing PDS member 


//WPR109A JOB INTERN,SUSI,CLASS=A,NOTIFY=&SYSUID
//STEP1 EXEC PGM=IEBGENER
//SYSUT1 DD DSN=WPR109.MAR10.PSFILE,DISP=OLD
//SYSUT2 DD DSN=WPR109.MAR10.PDS(M1),DISP=OLD
//SYSIN DD DUMMY
//SYSPRINT DD SYSOUT=*