
//* copy all the members of one PDS to another PDS


//WPR109A JOB INTERN,SUSI,CLASS=A,NOTIFY=&SYSUID
//STEP1 EXEC PGM=IEBCOPY
//DD1 DD DSN=WPR109.INTERN.SRCPDS,DISP=OLD
//DD2 DD DSN=WPR109.INTERN.TARPDS,DISP=(NEW,CATLG,DELETE),SPACE=(TRK,(2,2,1)),DCB=(LRECL=80,RECFM=FB,BLKSIZE=800)
//SYSIN DD *
        REPLACE INDD=DD1,OUTDD=DD2
//SYSPRINT DD SYSOUT=*