
//* copy the selected members


//WPR109A JOB INTERN,SUSI,CLASS=A,NOTIFY=&SYSUID
//STEP1 EXEC PGM=IEBCOPY
//DD1 DD DSN=WPR109.INTERN.SRCPDS,DISP=OLD
//DD2 DD DSN=WPR109.INTERN.TARPDS,DISP=(NEW,CATLG,DELETE),SPACE=(TRK(1,3,1)),DCB=(LRECL=80,RECFM=FB,BLKSIZE=800)
//SYSIN DD *
        COPY INDD=DD1,OUTDD=DD2
        SELECT MEMBER=(M1)
//SYSPRINT DD SYSOUT=*