

//* copy the member1 M1 & M2 from one PDS to another PDS as MEM1 & MEM2.


//WPR109A JOB INTERN,SUSI,CLASS=A,NOTIFY=&SYSUID
//STEP1 EXEC PGM=IEBCOPY
//DD1 DD DSN=WPR109.INTERN.SRCPDS,DISP=OLD
//DD2 DD DSN=WPR109.INTERN.TARPDS,DISP=OLD
//SYSIN DD *
        COPY INDD=DD1,OUTDD=DD2
        SELECT MEMBER=((M1,MEM1,R)(M2.MEM2,R))
/*
//SYSPRINT DD SYSOUT=*