

//*DELETE ONE DATASET USING THE IEFBR14.


//WPR109A JOB INTERN,SUSI,CLASS=A,NOTIFY=&SYSUID
//STEP1 EXEC PGM=IEFBR14
//DD1 DD DSN=WPR109.INTERN.PDSFILE,
//       DISP=(OLD,DELETE,DELETE)
	 