


/*write aprogram to sort the employee records on ENO for all employee
of sales department who has taken the loan and repaid the 50% of loan.
(using input procedure). Assume the input file contains with
ENO, ENAME, SALARY, LOAN AMT, AND BALANCE-LOAN-AMT.


IDENTIFICATION DIVISION.
PROGRAM-ID. PGM1.
ENVIRONMENT DIVISION.
INPUT-OUTPUT SECTION.
FILE-CONTROL.
	SELECT INFILE ASSIGN TO DD1.
	SELECT WRKFILE ASSIGN TO DD2.
	SELECT OUTFILE ASSIGN TO DD3.
DATA DIVISION.
FILE SECTION.
FD INFILE.
	COPY CPRG6 REPLACING ==:XXX:== BY ==I==.
SD WRKFILE.
	COPY CPRG6 REPLACING ==:XXX:== BY ==W==.
FD OUTFILE.
	COPY CPRG6 REPLACING ==:XXX:== BY ==O==.
WORKING-STORAGE SECTION.
77 EOF PIC X(1) VALUE ‘Y’.
PROCEDURE DIVISION.
MAIN-PARA.
	SORT WRKFILE
	ON ASCENDING W-EMPNO
	INPUT PROCEDURE INP-PARA
	GIVING OUTFILE.
	STOP RUN.
INP-PARA.
	OPEN INPUT INFILE.
		PERFORM UNTIL ( EOF = ‘N’ )
	READ INFILE
	AT END
		DISPLAY “END OF FILE!”
		MOVE ‘N’ TO EOF
	NOT AT END
	IF I-LOANBAL >( I-LOAN / 2)
		RELEASE W-REC FROM I-REC
	END-IF
	END-READ
END-PERFORM.


