

/*Consider the input file with RNO, SNAME, TEST1, TEST2, TEST3, AVG. 
  Write a program to get the top ten students base on average and test1 > = average.
  (using output procedure).

IDENTIFICATION DIVISION.
PROGRAM-ID. PGM2.
ENVIRONMENT DIVISION.
INPUT-OUTPUT SECTION.
FILE-CONTROL.
	SELECT INFILE ASSIGN TO DD1.
	SELECT WRKFILE ASSIGN TO DD2.
	SELECT OUTFILE ASSIGN TO DD3.
DATA DIVISION.
FILE SECTION.
FD INFILE.
	COPY CPRG7 REPLACING ==:XXX:== BY ==I==.
SD WRKFILE.
	COPY CPRG7 REPLACING ==:XXX:== BY ==W==.
FD OUTFILE.
	COPY CPRG7 REPLACING ==:XXX:== BY ==O==.
WORKING-STORAGE SECTION.
77 EOF PIC X(1) VALUE ‘Y’.
PROCEDURE DIVISION.
MAIN-PARA.
	SORT WRKFILE
	ON ASCENDING W-AVG
	USING INFILE
	OUTPUT PROCEDURE OUT-PARA.
	STOP RUN.
OUT-PARA.
	OPEN OUTPUT OUTFILE.
		PERFORM UNTIL ( EOF = ‘N’ )
	RETURN WRKFILE INTO O-REC
	AT END
		DISPLAY “END OF FILE!”
		MOVE ‘N’ TO EOF
	CLOSE OUTFILE
	NOT AT END
		DISPLAY ‘O-TEST1’ O-TEST1
		DISPLAY ‘O-AVG ‘ O-AVG
	IF O-TEST1 >= O-AVG
		WRITE O-REC
	END-IF
	END-RETURN
END-PERFORM.