


/*write a program to implement both the input and output procedures using SORT.
  input procedure	:	to get the list of employees working in department number 10
  output procedure      :       to get the employees who are earning more than 3000 salary


IDENTIFICATION DIVISION.
PROGRAM-ID. PRG37.
ENVIRONMENT DIVISION.
INPUT-OUTPUT SECTION.
FILE-CONTROL.
	SELECT INFILE ASSIGN TO DD1.
	SELECT WRKFILE ASSIGN TO DD2.
	SELECT OUTFILE ASSIGN TO DD3.
DATA DIVISION.
FILE SECTION.
FD INFILE.
	COPY CPRG5 REPLACING ==:XXX:== BY ==I==.
SD WRKFILE.
	COPY CPRG5 REPLACING ==:XXX:== BY ==W==.
FD OUTFILE.
	COPY CPRG5 REPLACING ==:XXX:== BY ==O==.
WORKING-STORAGE SECTION.
77 EOF1 PIC X(1) VALUE ‘Y’.
77 EOF2 PIC X(1) VALUE ‘Y’.
PROCEDURE DIVISION.
MAIN-PARA.
	SORT WRKFILE
	ON ASCENDING W-EMPNO
	INPUT PROCEDURE INP-PARA
	OUTPUT PROCEDURE OUT-PARA.
	STOP RUN.
INP-PARA.
	OPEN INPUT INFILE.
		PERFORM UNTIL ( EOF1 = ‘N’ )
	READ INFILE
	AT END
		DISPLAY “END OF FILE!”
		MOVE ‘N’ TO EOF1
	NOT AT END
	IF I-EMPDEPT = 10
		DISPLAY “I-EMPDEPT” I-EMPDEPT
		RELEASE W-REC FROM I-REC
	END-IF
	END-READ
END-PERFORM.
OUT-PARA.
	OPEN OUTPUT OUTFILE.
		PERFORM UNTIL ( EOF2 = ‘N’ )
	RETURN WRKFILE INTO O-REC
	AT END
		DISPLAY “END OF FILE!”
		MOVE ‘N’ TO EOF2
	CLOSE OUTFILE
	NOT AT END
	IF O-EMPSAL > 3000
		DISPLAY “O-EMPSAL” O-EMPSAL
	WRITE O-REC
	END-IF
	END-RETURN
END-PERFORM.