2. Create a cobol program to transfer the control to other cobol program using XCTL

  IDENTIFICATION DIVISION.       
  PROGRAM-ID. EMPGM1.            
  DATA DIVISION.                 
  WORKING-STORAGE SECTION. 
  77 WS-CA PIC X(3).        
  PROCEDURE DIVISION. 
     MOVE 'HAI' TO WS-CA.   
     EXEC CICS
        XCTL PROGRAM('PGM3')
        COMMAREA(WS-CA)
        LENGTH(3)
     END-EXEC.
     EXEC CICS                     
         RETURN                    
     END-EXEC.     
     STOP RUN. 
         