

/*Allocate a KSDS using IDCAMS


//WPR109A JOB WIPRO,SUSI,CLASS=A,NOTIFY=&SYSUID
//STEP1 EXEC PGM=IDCAMS
//SYSIN DD *
    DEFINE CLUSTER(        -
           NAME(WPR109.MAR11.EMPKSDS)    -
           INDEXED     -
           KEYS(3,0)     -
           RECORDSIZE(80,80)    -
           CYL(1,1)       -
          )
/*
//SYSPRINT DD SYSOUT=*
//SYSOUT DD SYSOUT=*