

/*Allocate a KSDS using IEFBR14.

//WPR109A JOB WIPRO,SUSI,CLASS=A,NOTIFY=&SYSUID
//STEP1 EXEC PGM=IEFBR14
//DD1 DD DSN=WPR109.MAR11.KSDS,
//       DISP=(NEW,CATLG,DELETE),
//       SPACE=(CYL,(1,1,0)),
//       DCB=(LRECL=80,RECFM=FB,BLKSIZE)