

/* write a program to search a given element in an array using search and search all command.


IDENTIFICATION DIVISION.
PROGRAM-ID. SEARCH1.
DATA DIVISION.
WORKING-STORAGE SECTION.
01 MYTABLE VALUE 'ABCDEFGHIJKLMNOPQRSTVUWXYZ'.
   02 CHARC PIC X(1) OCCURS 26 INDEXED BY I.
01 WS-CHAR PIC X(1) VALUE '1'.
PROCEDURE DIVISION.
MAIN-PARA.
       SET I TO 1 
       SEARCH CHARC
       AT ENG DISPLAY "END OF THE TABLE YOU ENTERED" WS-CHAR
           WHEN WS-CHAR EQUAL TO CHARC(1)
           DISPLAY WS-CHAR "FOUND"
           DISPLAY CHARC(1) "CHARC"