

//* merge the content of 2 files using the SORT utility


//WPR109A JOB INTERN,SUSI,CLASS=A,NOTIFY=&SYSUID
//STEP1 EXEC PGM=SORT
//SORTIN01 DD DSN=WPR109.INTERN.FILE1,DISP=OLD
//SORTIN02 DD DSN=WPR109.INTERN.FILE2,DISP=OLD
//SORTOUT DD DSN=WPR0GS.INTERN.NEWFILE,DISP=OLD
//SYSIN DD *
        MERGE FIELDS=(1,3,CH,A)
/*
//SYSPRINT DD SYSOUT=*