

//* copy the employee records of particular department in descending order of EMPID


//WPR109A JOB INTERN,SUSI,CLASS=A,NOTIFY=&SYSUID
//STEP1 EXEC PGM=SORT
//SORTIN DD DSN=WPR109.INTERN.PS1,DISP=OLD
//SORTOUT DD DSN=WPR109.INTERN.PS2,DISP=(NEW,CATLG,DELETE),SPACE=(TRK,(2,2,0)),DCB=(LRECL=80,RECFM=FB,BLKSIZE=800)
//SYSIN DD *
        SORT FIELDS=(1,3,CH,D)
        INCLUDE COND=(11,5,CH,EQ,SALES)
/*
//SYSPRINT DD SYSOUT=*
//SYSOUT DD SYSOUT=*