
//* copy the employee records of all departments except SALES


//WPR109A JOB INTERN,SUSI,CLASS=A,NOTIFY=&SYSUID
//STEP1 EXEC PGM=SORT
//SORTIN DD DSN=WPR109.INTERN.OLD,DISP=OLD
//SORTOUT DD DSN=WPR109.INTERN.NEW,DISP=(NEW,CATLG,DELETE),SPACE=(TRK,(2,2,0)),DCB=(LRECL=80,RECFM=FB,BLKSIZE=800)
//SYSIN DD *
        SORT FIELDS=(1,12,CH,A)
        OMIT COND=(11,2,CH,EQ,SALES)
/*
//SYSPRINT DD SYSOUT=*