


/*write a program to get the employee records from user and 
write into the PS dataset ( both output and extend mode).
PS file name (EMP_PS)
ENO,ENAME,SAL,DNO,LOCATION
101,RAJ,2000,10,PUNE



IDENTIFICATION DIVISION.
PROGRAM-ID. PGM1.
ENVIRONMENT DIVISION.
INPUT-OUTPUT SECTION.
FILE-CONTROL.
	SELECT OUTFILE ASSIGN TO DD1
	ORGANIZATION IS SEQUENTIAL
	ACCESS MODE IS SEQUENTIAL
	FILE STATUS IS WS-FS1.
DATA DIVISION.
FILE SECTION.
FD OUTFILE.
01 OUT-REC.
	02 I-EMPNO PIC X(3).
	02 FILLER PIC X.
	02 I-EMPNAME PIC X(6).
	02 FILLER PIC X.
	02 I-EMPDEPT PIC X(2).
	02 FILLER PIC X.
	02 I-EMPSAL PIC X(4).
	02 FILLER PIC X(62).
WORKING-STORAGE SECTION.
77 WS-FS1 PIC 9(2).
01 INP-DATA.
	02 EMP-NO PIC X(3).
	02 FILLER PIC X.
	02 EMP-NAME PIC X(6).
	02 FILLER PIC X.
	02 EMP-DEPT PIC X(2).
	02 FILLER PIC X.
	02 EMPSAL PIC X(4).
PROCEDURE DIVISION.
MAIN-PARA.
	PERFORM OPEN-PARA.
	PERFORM WRITE-PARA.
	PERFORM CLOSE-PARA.
	STOP RUN.
OPEN-PARA.
	OPEN EXTEND OUTFILE.
	IF WS-FS1 = 00
		DISPLAY “WRITE WRITTEN SUCCESSFULLY!”
	ELSE
		DISPLAY “ERROR IN WRITING THE FILE!”
	END-IF.
WRITE-PARA.
	ACCEPT INP-DATA.
	MOVE INP-DATA TO OUT-REC
	WRITE OUT-REC
	END-WRITE.
CLOSE-PARA.
	CLOSE OUTFILE.
