


/*write a program to display a content of above created employee file (EMP_PS) in spool.



IDENTIFICATION DIVISION.
PROGRAM-ID. PGM2.
ENVIRONMENT DIVISION.
INPUT-OUTPUT SECTION.
FILE-CONTROL.
	SELECT INFILE ASSIGN TO DD1
	ORGANIZATION IS SEQUENTIAL
	ACCESS MODE IS SEQUENTIAL DATA DIVISION
	FILE STATUS IS WS-FS1.

FILE SECTION.
FD INFILE.
01 IN-REC.
	02 I-EMPNO PIC X(3).
	02 I-EMPNAME PIC X(6).
	02 I-EMPDEPT PIC X(2).
	02 I-EMPSAL PIC X(4).
	02 FILLER PIC X(65). 

WORKING-STORAGE SECTION.
77 WS-FS1 PIC 9(2).
77 WS-FLAG PIC X(1) VALUE ‘Y’.
PROCEDURE DIVISION.
MAIN-PARA.
	PERFORM OPEN-PARA.
	PERFORM READ-PARA UNTIL WS-FLAG = ‘N’.
	PERFORM CLOSE-PARA.
	STOP RUN.
OPEN-PARA.
	OPEN INPUT INFILE.
	IF WS-FS1 = 00
		DISPLAY “FILE OPENED SUCCESSFULLY!”
	ELSE
		DISPLAY “ERROR IN OPENING THE FILE!”
	END-IF.
READ-PARA.
	READ INFILE
	AT END
		DISPLAY “END OF FILE!”
		MOVE ‘N’ TO WS-FLAG
	NOT AT END DISPLAY IN-REC
	END-READ.
CLOSE-PARA.
	CLOSE INFILE.



























